Repository: common-repository/thecartpress-frontend
Catalog: languages/tcp-fe-*.po
Languages: it_it

source: My Addresses
it_it: I miei indirizzi

source: Address
it_it: Indirizzo

source: My Downloads
it_it: I miei Download

source: My Orders
it_it: I miei ordini

source: <strong>My Account page</strong> has been deleted.
it_it: <strong>Pagina il mio Account</strong> è stato eliminato.

source: <strong>Addresses list page</strong> has been deleted.
it_it: <strong>Pagina di elenco di indirizzi</strong> è stato eliminato.

source: <strong>Address Edit page</strong> has been deleted.
it_it: <strong>Indirizzo modifica pagina</strong> cancellata.

source: <strong>Downloadables list page</strong> has been deleted.
it_it: <strong>Pagina dei Downloads</strong> è stato eliminato.

source: <strong>Orders list page</strong> has been deleted.
it_it: <strong>Pagina elenco ordini</strong> è stato eliminato.

source: The Addresses list page has been created
it_it: La pagina con gli indirizzi è stata creata

source: The Address edit page has been created
it_it: La pagina di modifica degli indirizzi è stata creata

source: The Downloadables list page has been created
it_it: La pagina con l'elenco dei Downloads è stata creata

source: The orders list page has been created
it_it: La pagina degli ordini è stata creata

source: See all addresses
it_it: Guarda tutti gli indirizzi

source: See all orders
it_it: Guarda tutti gli ordini

source: To access to your download items, please visit <a href="%s">the download area</a>.
it_it: Per accedere ai tuoi download, perfavore visita <a href="%s">l'area download</a>.

source: You need to login to see your address.
it_it: Devi fare il login per vedere i tuoi indirizzi.

source: Address deleted
it_it: Indirizzo cancellato

source: List of addresses
it_it: Lista di indirizzi

source: Create new address
it_it: Crea un nuovo indirizzo

source: Name
it_it: Nome

source: Street
it_it: Via

source: The list of addresses is empty
it_it: La lista degli indirizzi è vuota

source: Shipping
it_it: Spedizione

source: Billing
it_it: Fatturazione

source: edit
it_it: modifica

source: delete
it_it: cancella

source: Do you really want to delete this address?
it_it: Vuoi realmente cancellare questo indirizzo?

source: Yes
it_it: Si

source: No, I don't
it_it: No, io non voglio

source: You need to login to see your orders.
it_it: Devi fare il login per vedere i tuoi ordini.

source: Return to the list of Orders
it_it: Ritorna alla lista degli ordini

source: Date
it_it: Data

source: status
it_it: Stato

source: Total
it_it: Totale
